app/Http/Controllers/Api/SeriesController.php

select * from `series` order by `nome` asc
---
    public function index(Request $request)
    {
        $query = Series::query();
        if ($request->has('nome')) {
            $query->where('nome', $request->nome);
        }

        return $query->paginate(5);

update `series` set `nome` = 'Outra série', `series`.`updated_at` = '2022-06-29 20:05:17' where `id` = 12
---
    public function update(Series $series, SeriesFormRequest $request)
    {
        $series->fill($request->all());
        $series->save();

delete from `series` where `id` = 12
---
    public function destroy(int $series, Authenticatable $user)
    {
        //dd($user->tokenCan('is_admin'));
        Series::destroy($series);