routes/api.php


Route::middleware('auth:sanctum')->group(function () {
    Route::apiResource('/series', \App\Http\Controllers\Api\SeriesController::class);
    Route::get('/series/{series}/seasons', function (\App\Models\Series $series) {
        return $series->seasons;
    });
    Route::get('/series/{series}/episodes', function (\App\Models\Series $series) {
        return $series->episodes;
    });
---
select * from `seasons` where `seasons`.`series_id` = 10 and `seasons`.`series_id` is not null
select `episodes`.*, `seasons`.`series_id` as `laravel_through_key` from `episodes` inner join `seasons` on `seasons`.`id` = `episodes`.`season_id` where `seasons`.`series_id` = 10