app/Repositories/EloquentSeriesRepository.php

    public function add(SeriesFormRequest $request) : Series
    {
        return $serie = DB::transaction(function () use ($request, &$serie) {
            $serie = Series::create($request->all());
            $seasons = [];
            for($i = 1; $i <= $request->seasonsQty ; $i++){
                $seasons[] = [
                    'series_id' => $serie->id,
                    'number' => $i,
                ];
            }
            Season::insert($seasons);

            $episodes = [];
            foreach ($serie->seasons as $season){
                for($j = 1; $j <= $request->episodesPerSeason ; $j++){
                    $episodes[] = [
                        'season_id' => $season->id,
                        'number' => $j
                    ];
                }
            }
            Episode::insert($episodes);
---
select * from `seasons` where `seasons`.`series_id` = 33 and `seasons`.`series_id` is not null
insert into `series` (`nome`, `cover`, `updated_at`, `created_at`) values ('The Expanse', '', '2022-06-30 04:59:23', '2022-06-30 04:59:23')
insert into `seasons` (`number`, `series_id`) values (1, 33), (2, 33), (3, 33), (4, 33), (5, 33)
insert into `episodes` (`number`, `season_id`) values (1, 138), (2, 138), (3, 138), (4, 138), (5, 138), (6, 138), (7, 138), (8, 138), (9, 138), (10, 138), (11, 138), (12, 138), (1, 139), (2, 139), (3, 139), (4, 139), (5, 139), (6, 139), (7, 139), (8, 139), (9, 139), (10, 139), (11, 139), (12, 139), (1, 140), (2, 140), (3, 140), (4, 140), (5, 140), (6, 140), (7, 140), (8, 140), (9, 140), (10, 140), (11, 140), (12, 140), (1, 141), (2, 141), (3, 141), (4, 141), (5, 141), (6, 141), (7, 141), (8, 141), (9, 141), (10, 141), (11, 141), (12, 141), (1, 142), (2, 142), (3, 142), (4, 142), (5, 142), (6, 142), (7, 142), (8, 142), (9, 142), (10, 142), (11, 142), (12, 142)